import time

n = 10
m = 12
field = [['W', '.', '.',  '.', '.', '.', '.', '.', '.', 'W', 'W', '.'],
         ['.', 'W', 'W', 'W', '.', '.', '.', '.', '.', 'W', 'W', 'W'],
         ['.', '.', '.', '.', 'W', 'W', '.', '.', '.', 'W', 'W', '.'],
         ['.', '.', '.', '.', '.', '.', '.', '.', '.', 'W', 'W', '.'],
         ['.', '.', '.', '.', '.', '.', '.', '.', '.', 'W', '.', '.'],
         ['.', '.', 'W', '.', '.', '.', '.', '.', '.', 'W', '.', '.'],
         ['.', 'W', '.', 'W', '.', '.', '.', '.', '.', 'W', 'W', '.'],
         ['W', '.', 'W', '.', 'W', '.', '.', '.', '.', '.', 'W', '.'],
         ['.', 'W', '.', 'W', '.', '.', '.', '.', '.', '.', 'W', '.'],
         ['.', '.', 'W', '.', '.', '.', '.', '.', '.', '.', 'W', '.']]


def dfs(x, y):
    # 今いるところを'.'に置き換える
    field[x][y] = '.'
    # 移動する8方向をループ
    for i in range(-1, 2):
        for j in range(-1, 2):
            nx = x + i
            ny = y + j
            if (nx >= 0 and nx < n and ny >= 0 and ny < m):
                if (field[nx][ny] == 'W'):
                    dfs(nx, ny)
    return


def solve():
    res = 0
    for i in range(n):
        for j in range(m):
            # 'W'が残っていたらそこからはじめる
            if (field[i][j] == 'W'):
                dfs(i, j)
                res += 1
    print(res)


start = time.perf_counter()
solve()
end = time.perf_counter()
print("time", end-start)
